# 통나무 자루기
# 문제
# 벌목꾼 백은진은 나무를 종이 공장에 옮겨야 한다. 하지만, 통나무의 길이가 너무 길어서 트럭에 들어가지 않으므로, 여러개의 조각으로 나눠야 한다.
#
# 통나무의 길이는 L cm이다. 그리고 통나무의 특정한 위치에서만 자를 수 있다. 통나무를 자를 수 있는 위치가 주어지고, 이때 이 위치는 통나무의 가장 왼쪽에서부터 떨어진 거리이다. 백은진은 많아야 C번 통나무를 자를 수 있다.
#
# 이때, 통나무의 가장 긴 조각을 작게 만드는 프로그램을 작성하시오.
#
# 입력
# 첫째 줄에 L, K와 C가 주어진다. L은1,000,000,000보다 작거나 같은 자연수이고, K는 통나무를 자를 수 있는 위치의 개수이다. K와 C는 10,000보다 작거나 같은 자연수이다. 둘째 줄에 통나무를 자를 수 있는 위치가 주어진다.
#
# 출력
# 첫째 줄에 두 개의 수를 출력한다. 첫 번째 수는 가장 긴 조각의 길이이고, 두 번째 수는 그 때 처음 자르는 위치를 출력한다. 만약 가능한 것이 여러 가지라면, 처음 자르는 위치가 작은 것을 출력한다.

def solution(n, k, c, p):

    length = []
    length = 0
    location = 0
    # 만약 자르는 위차가 1개 이면, 여러개 일때는?
    for place in p:
        if n-place > length:
            length = n-place
            location = place

    return length, location


if __name__ == '__main__':
    n = 9
    k = 2
    c = 1
    place = [4,
             5]

    print(*solution(n, k, c, place))
